# 데이터 정제 및 준비

## 누락된 데이터 처리하기

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 누락된 데이터 골라내기

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1,NA,3.5,NA,7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA,NA,NA], [NA,6.5,3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7,3))

In [19]:
df.iloc[:4,1] = NA

In [20]:
df.iloc[:2,2] = NA

In [21]:
df

          0         1         2
0 -1.988976       NaN       NaN
1  0.432146       NaN       NaN
2  0.750686       NaN -0.621491
3 -0.675217       NaN  0.864916
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

In [22]:
df.dropna()

          0         1         2
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

In [23]:
df.dropna(thresh=2)

          0         1         2
2  0.750686       NaN -0.621491
3 -0.675217       NaN  0.864916
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

### 결측치 채우기

In [24]:
df.fillna(0)

          0         1         2
0 -1.988976  0.000000  0.000000
1  0.432146  0.000000  0.000000
2  0.750686  0.000000 -0.621491
3 -0.675217  0.000000  0.864916
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

In [25]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -1.988976  0.500000  0.000000
1  0.432146  0.500000  0.000000
2  0.750686  0.500000 -0.621491
3 -0.675217  0.500000  0.864916
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -1.988976  0.000000  0.000000
1  0.432146  0.000000  0.000000
2  0.750686  0.000000 -0.621491
3 -0.675217  0.000000  0.864916
4  0.671590 -0.080980  0.077737
5 -0.729856 -1.369220 -2.394495
6 -0.297246 -0.755891  0.375369

In [28]:
df = pd.DataFrame(np.random.randn(6,3))

In [29]:
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA

In [30]:
df

          0         1         2
0  0.400171 -2.024826 -1.341357
1  0.997027 -1.456330  0.855809
2 -1.240522       NaN -0.339371
3 -0.223676       NaN -0.051411
4  1.063501       NaN       NaN
5 -1.810314       NaN       NaN

In [31]:
df.fillna(method='ffill')

          0         1         2
0  0.400171 -2.024826 -1.341357
1  0.997027 -1.456330  0.855809
2 -1.240522 -1.456330 -0.339371
3 -0.223676 -1.456330 -0.051411
4  1.063501 -1.456330 -0.051411
5 -1.810314 -1.456330 -0.051411

In [32]:
df.fillna(method = 'ffill',limit=2)

          0         1         2
0  0.400171 -2.024826 -1.341357
1  0.997027 -1.456330  0.855809
2 -1.240522 -1.456330 -0.339371
3 -0.223676 -1.456330 -0.051411
4  1.063501       NaN -0.051411
5 -1.810314       NaN -0.051411

In [33]:
data = pd.Series([1.,NA,3.5,NA,7])

In [34]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 데이터 변형

### 중복 제거하기

In [35]:
data = pd.DataFrame({'k1':['one','two']*3 +['two'], 'k2':[1,1,2,3,3,4,4]})

In [36]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

#### 중복인 row를 확인 duplicated()

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

#### duplicated 에서 False인 값 return

In [38]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [39]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 함수나 매핑을 이용해서 데이터 변형하기

In [41]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'], 
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [42]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [43]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pic',
    'nova lox':'salmon'
}

In [44]:
lowercased = data['food'].str.lower()

In [45]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [46]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pic
8     nova lox     6.0  salmon

In [47]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pic
8    salmon
Name: food, dtype: object

### 값 치환하기

In [48]:
data = pd.Series([1., -999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 축(Row) 색인(index) 이름 바꾸기

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])

In [54]:
transform = lambda x:x[:4].upper()

In [55]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [56]:
data.index = data.index.map(transform)

In [57]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [58]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [59]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [60]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 개별화와 양자화

In [61]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]

In [62]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [63]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

#### 4개의 그룹으로 분류됨

In [64]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [65]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

#### right = False를 사용하여 구간 값 재설정

In [66]:
pd.cut(ages,[18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

#### labes로 그룹의 이름 설정

In [67]:
group_names = ['Youth','YoungAdult','MiddleAged','Senoir']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senoir', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senoir']

In [68]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.62, 0.82], (0.21, 0.42], (0.21, 0.42], (0.21, 0.42], (0.01, 0.21], ..., (0.62, 0.82], (0.21, 0.42], (0.01, 0.21], (0.62, 0.82], (0.42, 0.62]]
Length: 20
Categories (4, interval[float64]): [(0.01, 0.21] < (0.21, 0.42] < (0.42, 0.62] < (0.62, 0.82]]

In [69]:
data = np.random.randn(1000) # 정규 분포

In [70]:
cats = pd.qcut(data, 4)
cats

[(0.0498, 0.695], (-3.2079999999999997, -0.709], (0.695, 3.48], (0.695, 3.48], (0.0498, 0.695], ..., (-3.2079999999999997, -0.709], (0.695, 3.48], (-3.2079999999999997, -0.709], (-0.709, 0.0498], (-0.709, 0.0498]]
Length: 1000
Categories (4, interval[float64]): [(-3.2079999999999997, -0.709] < (-0.709, 0.0498] < (0.0498, 0.695] < (0.695, 3.48]]

In [71]:
pd.value_counts(cats)

(-3.2079999999999997, -0.709]    250
(-0.709, 0.0498]                 250
(0.0498, 0.695]                  250
(0.695, 3.48]                    250
dtype: int64

#### %로 그룹 지정

In [72]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0498, 1.364], (-1.33, 0.0498], (1.364, 3.48], (0.0498, 1.364], (0.0498, 1.364], ..., (-1.33, 0.0498], (1.364, 3.48], (-1.33, 0.0498], (-1.33, 0.0498], (-1.33, 0.0498]]
Length: 1000
Categories (4, interval[float64]): [(-3.2079999999999997, -1.33] < (-1.33, 0.0498] < (0.0498, 1.364] < (1.364, 3.48]]

### 특잇값을 찾고 제외하기

In [73]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.037717     0.000596    -0.001966     0.022469
std       0.965932     1.021062     0.992856     1.010429
min      -2.931012    -3.140671    -3.549409    -3.092584
25%      -0.661881    -0.727809    -0.695480    -0.665766
50%      -0.042413     0.022220    -0.002154     0.004156
75%       0.587357     0.673165     0.692264     0.694338
max       3.163590     3.054836     3.019756     3.561440

In [74]:
col = data[2]
col[np.abs(col) > 3] # 절대값 3 초과 값

174   -3.198373
833    3.019756
999   -3.549409
Name: 2, dtype: float64

In [75]:
data[(np.abs(data) > 3).any(1)] # 절대값 3 초과 값을 포함하는 row값

            0         1         2         3
7    3.163590 -0.304675  0.044650 -1.554187
47   1.120760 -0.831301  0.929773  3.199390
124  1.646998  0.321707 -0.933804  3.561440
174 -0.465656  0.364438 -3.198373  0.601304
336 -1.981092  3.054836 -0.653934 -0.839511
484 -0.193073  0.133166 -1.607568 -3.092584
487 -0.751947  0.190697  0.666925  3.429093
499 -2.517175 -1.065337  0.605325  3.075971
629  0.282917 -3.140671 -0.130184  0.230052
833  2.235234 -1.118961  3.019756  0.667146
973 -1.144774  0.210699  0.380015  3.139659
978 -0.912528 -3.103598  0.120369  0.431540
999  1.106837  0.483430 -3.549409 -1.719891

In [76]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.037881     0.000786    -0.001238     0.021156
std       0.965403     1.020165     0.990361     1.005710
min      -2.931012    -3.000000    -3.000000    -3.000000
25%      -0.661881    -0.727809    -0.695480    -0.665766
50%      -0.042413     0.022220    -0.002154     0.004156
75%       0.587357     0.673165     0.692264     0.694338
max       3.000000     3.000000     3.000000     3.000000

In [77]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1 -1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

### 치환과 임의 샘플링

In [78]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [79]:
sampler = np.random.permutation(5)

In [80]:
sampler

array([0, 3, 4, 1, 2])

In [81]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [83]:
df.sample(n=3)

   0  1   2   3
1  4  5   6   7
0  0  1   2   3
2  8  9  10  11

In [84]:
choices = pd.Series([5,7,-1,6,4])

In [85]:
draws = choices.sample(n=10, replace = True)
draws

2   -1
4    4
1    7
4    4
1    7
4    4
4    4
3    6
4    4
3    6
dtype: int64

### 표시자 / 더미 변수 계산하기

In [86]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [87]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [88]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [89]:
df_with_dummy = df[['data1']].join(dummies)

In [90]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [91]:
mnames = ['movie_id','title','genres']

#### https://grouplens.org/datasets/movielens/ 데이터 받아오기

In [92]:
movies = pd.read_table('ch07/movies.csv',sep=',',header=0,names=mnames)
movies[:10]

,movie_id,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [93]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [94]:
genres

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [95]:
zero_matrix = np.zeros((len(movies),len(genres)))
dummies = pd.DataFrame(zero_matrix,columns=genres)

In [96]:
gen = movies.genres[0]

gen.split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [97]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2, 3, 4], dtype=int64)

In [98]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [99]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [100]:
movies_windic.iloc[0]

movie_id                                                              1
title                                                  Toy Story (1995)
genres                      Adventure|Animation|Children|Comedy|Fantasy
Genre_Adventure                                                     1.0
Genre_Animation                                                     1.0
Genre_Children                                                      1.0
Genre_Comedy                                                        1.0
Genre_Fantasy                                                       1.0
Genre_Romance                                                       0.0
Genre_Drama                                                         0.0
Genre_Action                                                        0.0
Genre_Crime                                                         0.0
Genre_Thriller                                                      0.0
Genre_Horror                                                        0.0
Genre_Mystery                                                       0.0
Genre_Sci-Fi                                                        0.0
Genre_War                                                           0.0
Genre_Musical                                                       0.0
Genre_Documentary                                                   0.0
Genre_IMAX                                                          0.0
Genre_Western                                                       0.0
Genre_Film-Noir                                                     0.0
Genre_(no genres listed)                                            0.0
Name: 0, dtype: object

In [101]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [102]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [103]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 문자열 다루기

### 문자열 객체 메서드

In [104]:
val = 'a,b, guido'

In [105]:
val.split(',')

['a', 'b', ' guido']

In [106]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [107]:
first,second,third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [108]:
'::'.join(pieces)

'a::b::guido'

In [109]:
'guido' in val

True

In [110]:
val.index(',')

1

In [111]:
val.find(':')

-1

In [112]:
# val.index(':')
# Error 발생

In [113]:
val.count(',')

2

In [114]:
val.replace(',','::')

'a::b:: guido'

In [115]:
val.replace(',','')

'ab guido'

### 정규 표현식

In [116]:
import re

#### \s+로 탭,스페이스,개행문자로 나누어 문자열 분리

In [117]:
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [118]:
regex = re.compile('\s+')

In [119]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [120]:
regex.findall(text)

[' ', '\t ', ' \t']

In [121]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [122]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [123]:
m = regex.search(text)
m

In [124]:
text[m.start():m.end()]

'dave@google.com'

#### 정규 표현 패턴이 문자열의 시작점에서부터 일치하는지 검사

In [125]:
print(regex.match(text))

None

#### 찾은 패턴을 주어진 문자열로 치환해 새 문자열 return

In [126]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

#### ()안에 일치하는 패턴만 뽑아 가져오기

In [127]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags = re.IGNORECASE)

In [128]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [129]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [130]:
print(regex.sub(r'Username: \1, Domain: \2, Shuffix: \3', text))

Dave Username: dave, Domain: google, Shuffix: com
Steve Username: steve, Domain: gmail, Shuffix: com
Rob Username: rob, Domain: gmail, Shuffix: com
Ryan Username: ryan, Domain: yahoo, Shuffix: com

### pandas의 벡터화된 문자열 함수

In [131]:
data = {'Dave':'dave@google.com', 'Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [132]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [133]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [134]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [135]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [136]:
matches = data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [137]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object